###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.imichka-kubernetes-certs-controllers will be destroyed
  # (because aws_s3_bucket.imichka-kubernetes-certs-controllers is not in configuration)
  - resource "aws_s3_bucket" "imichka-kubernetes-certs-controllers" {
      - arn                         = "arn:aws:s3:::imichka-kubernetes-certs-controllers" -> null
      - bucket                      = "imichka-kubernetes-certs-controllers" -> null
      - bucket_domain_name          = "imichka-kubernetes-certs-controllers.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "imichka-kubernetes-certs-controllers.s3.eu-west-3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3R1K369G5AVDG" -> null
      - id                          = "imichka-kubernetes-certs-controllers" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-3" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "Env" = "prd"
        } -> null

      - grant {
          - id          = "bfbe8e5cff5d3be64d2d3c0e350d5d4a63f0367b324b075d343031bf6ec33f46" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.imichka-kubernetes-certs-workers will be destroyed
  # (because aws_s3_bucket.imichka-kubernetes-certs-workers is not in configuration)
  - resource "aws_s3_bucket" "imichka-kubernetes-certs-workers" {
      - arn                         = "arn:aws:s3:::imichka-kubernetes-certs-workers" -> null
      - bucket                      = "imichka-kubernetes-certs-workers" -> null
      - bucket_domain_name          = "imichka-kubernetes-certs-workers.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "imichka-kubernetes-certs-workers.s3.eu-west-3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3R1K369G5AVDG" -> null
      - id                          = "imichka-kubernetes-certs-workers" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-3" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "Env" = "prd"
        } -> null

      - grant {
          - id          = "bfbe8e5cff5d3be64d2d3c0e350d5d4a63f0367b324b075d343031bf6ec33f46" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_object.imichka-kubernetes-certs-controllers-object["ca-key.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-controllers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-controllers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-controllers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "ce0410db8c77c5fb137c267021220165" -> null
      - force_destroy          = false -> null
      - id                     = "ca-key.pem" -> null
      - key                    = "ca-key.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/controllers/ca-key.pem" -> null
      - source_hash            = "ce0410db8c77c5fb137c267021220165" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-controllers-object["ca.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-controllers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-controllers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-controllers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "645d03adf85521034dbdd60d56293885" -> null
      - force_destroy          = false -> null
      - id                     = "ca.pem" -> null
      - key                    = "ca.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/controllers/ca.pem" -> null
      - source_hash            = "645d03adf85521034dbdd60d56293885" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-controllers-object["kubernetes-key.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-controllers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-controllers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-controllers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "8313b9f9033b58d8e63f19c8d7a67b12" -> null
      - force_destroy          = false -> null
      - id                     = "kubernetes-key.pem" -> null
      - key                    = "kubernetes-key.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/controllers/kubernetes-key.pem" -> null
      - source_hash            = "8313b9f9033b58d8e63f19c8d7a67b12" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-controllers-object["kubernetes.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-controllers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-controllers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-controllers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "a5009a8b06fba1b30f9b09622ccbe51b" -> null
      - force_destroy          = false -> null
      - id                     = "kubernetes.pem" -> null
      - key                    = "kubernetes.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/controllers/kubernetes.pem" -> null
      - source_hash            = "a5009a8b06fba1b30f9b09622ccbe51b" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-controllers-object["service-account-key.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-controllers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-controllers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-controllers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "af1a99a11ce954445f5134357b2482fb" -> null
      - force_destroy          = false -> null
      - id                     = "service-account-key.pem" -> null
      - key                    = "service-account-key.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/controllers/service-account-key.pem" -> null
      - source_hash            = "af1a99a11ce954445f5134357b2482fb" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-controllers-object["service-account.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-controllers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-controllers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-controllers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "e61b3665a4bc9a84b8bcb7548f0f056c" -> null
      - force_destroy          = false -> null
      - id                     = "service-account.pem" -> null
      - key                    = "service-account.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/controllers/service-account.pem" -> null
      - source_hash            = "e61b3665a4bc9a84b8bcb7548f0f056c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["ca.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "645d03adf85521034dbdd60d56293885" -> null
      - force_destroy          = false -> null
      - id                     = "ca.pem" -> null
      - key                    = "ca.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/ca.pem" -> null
      - source_hash            = "645d03adf85521034dbdd60d56293885" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["worker-4-key.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "1177d8476d029f90e5e304c003507a08" -> null
      - force_destroy          = false -> null
      - id                     = "worker-4-key.pem" -> null
      - key                    = "worker-4-key.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/worker-4-key.pem" -> null
      - source_hash            = "1177d8476d029f90e5e304c003507a08" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["worker-4.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "1f0a2b690e33a63d0886b6f7f75edf20" -> null
      - force_destroy          = false -> null
      - id                     = "worker-4.pem" -> null
      - key                    = "worker-4.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/worker-4.pem" -> null
      - source_hash            = "1f0a2b690e33a63d0886b6f7f75edf20" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["worker-5-key.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "4f8d5d37d697cc220471106c552dd65b" -> null
      - force_destroy          = false -> null
      - id                     = "worker-5-key.pem" -> null
      - key                    = "worker-5-key.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/worker-5-key.pem" -> null
      - source_hash            = "4f8d5d37d697cc220471106c552dd65b" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["worker-5.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "ba913314754fc0d4e40e98f8faea61f8" -> null
      - force_destroy          = false -> null
      - id                     = "worker-5.pem" -> null
      - key                    = "worker-5.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/worker-5.pem" -> null
      - source_hash            = "ba913314754fc0d4e40e98f8faea61f8" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["worker-6-key.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "6319a6909a1c90f79914c873f960397b" -> null
      - force_destroy          = false -> null
      - id                     = "worker-6-key.pem" -> null
      - key                    = "worker-6-key.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/worker-6-key.pem" -> null
      - source_hash            = "6319a6909a1c90f79914c873f960397b" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_s3_object.imichka-kubernetes-certs-workers-object["worker-6.pem"] will be destroyed
  # (because aws_s3_object.imichka-kubernetes-certs-workers-object is not in configuration)
  - resource "aws_s3_object" "imichka-kubernetes-certs-workers-object" {
      - acl                    = "private" -> null
      - bucket                 = "imichka-kubernetes-certs-workers" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "ae0a3cf2113bfa404b22c576da89febf" -> null
      - force_destroy          = false -> null
      - id                     = "worker-6.pem" -> null
      - key                    = "worker-6.pem" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./certs/workers/worker-6.pem" -> null
      - source_hash            = "ae0a3cf2113bfa404b22c576da89febf" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
    }

  # aws_security_group.kubernetes-security-group will be destroyed
  # (because aws_security_group.kubernetes-security-group is not in configuration)
  - resource "aws_security_group" "kubernetes-security-group" {
      - arn                    = "arn:aws:ec2:eu-west-3:377346518720:security-group/sg-03dae53a57b8cd293" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-03dae53a57b8cd293" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6443
            },
        ] -> null
      - name                   = "kubernetes-security-group" -> null
      - owner_id               = "377346518720" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Env" = "prd"
        } -> null
      - vpc_id                 = "vpc-05c566a68c1b1624b" -> null
    }

  # aws_subnet.private-mastodon will be created
  + resource "aws_subnet" "private-mastodon" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-private-3"
        }
      + tags_all                                       = {
          + "Env"  = "prd"
          + "Name" = "subnet-private-3"
        }
      + vpc_id                                         = "vpc-05c566a68c1b1624b"
    }

  # aws_subnet.public will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-08f593b8cffcd2fd4"
      ~ tags                                           = {
          ~ "Name" = "subnet-public-1" -> "subnet-public-2"
        }
      ~ tags_all                                       = {
          ~ "Name" = "subnet-public-1" -> "subnet-public-2"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.public-mastodon will be created
  + resource "aws_subnet" "public-mastodon" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-public-4"
        }
      + tags_all                                       = {
          + "Env"  = "prd"
          + "Name" = "subnet-public-4"
        }
      + vpc_id                                         = "vpc-05c566a68c1b1624b"
    }

Plan: 2 to add, 1 to change, 16 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Terraform - Production`*